# GetServerGUID Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarFreeFormAccessor..::..GetServerGUID Method
RebarFreeFormAccessor Class See Also
---
Returns the GUID of the API server.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public Guid GetServerGUID()
```

Visual Basic
---
```text
Public Function GetServerGUID As Guid
```

Visual C++
---
```text
public:
Guid GetServerGUID()
```

# ### Return Value
The GUID of the API server
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This RebarFreeFormAccessor doesn't contain a valid rebar reference. |

# See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace